package top.top7.reflect;

/******
 *       Created by LEARNING on 2020/11/10 23:56.
 *
 **********************************************************************
 *                .-~~~~~~~~~-._       _.-~~~~~~~~~-.
 *            __.'              ~.   .~              `.__
 *          .'//                  \./                  \\`.
 *        .'//                     |                     \\`.
 *      .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
 *    .'//.-"                 `-.  |  .-'                 "-.\\`.
 *  .'//______.============-..   \ | /   ..-============.______\\`.
 *.'______________________________\|/______________________________`.
 *
 *
 *                     Don't forget to be awesome!                      
 **********************************************************************
 */

/**
 * 可变长参数:
 * 1. 参数类型... 变量名
 * 2. 可变长参数必须位于参数列表的最后一个(只能有一个可变长参数)
 * 3. 可以将可变长参数类型的数组直接传入,与同时传入多个可变长参数类型的参数效果相同
 * 4. 在传参时可以传   0-任意个  可变长参数类型的参数
 */
public class PReflect7Parameter {
    public static void main(String[] arguments) {
        m1(1,5,24,89,5);
    }

    static void m1(int... numbers) {
        for (int i : numbers) {
            System.out.println(i);
        }
    }
}
