package top.top7.annotation.test;

/******
 *       Created by LEARNING on 2021/2/4 10:55.
 *
 **********************************************************************
 *                .-~~~~~~~~~-._       _.-~~~~~~~~~-.
 *            __.'              ~.   .~              `.__
 *          .'//                  \./                  \\`.
 *        .'//                     |                     \\`.
 *      .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
 *    .'//.-"                 `-.  |  .-'                 "-.\\`.
 *  .'//______.============-..   \ | /   ..-============.______\\`.
 *.'______________________________\|/______________________________`.
 *
 *
 *                     Don't forget to be awesome!                      
 **********************************************************************
 */

/**
 * 类不存在id属性异常
 */
public class TypeNotIdException extends RuntimeException {
    public TypeNotIdException() {
    }

    public TypeNotIdException(String message) {
        super(message);
    }
}
