package top.top7.oop;

/******
 *       Created by LEARNING on 2021/2/28 1:20.
 *
 **********************************************************************
 *                .-~~~~~~~~~-._       _.-~~~~~~~~~-.
 *            __.'              ~.   .~              `.__
 *          .'//                  \./                  \\`.
 *        .'//                     |                     \\`.
 *      .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
 *    .'//.-"                 `-.  |  .-'                 "-.\\`.
 *  .'//______.============-..   \ | /   ..-============.______\\`.
 *.'______________________________\|/______________________________`.
 *
 *
 *                     Don't forget to be awesome!                      
 **********************************************************************
 */

/**
 * this关键字:
 * 1.一个对象一个this
 * 2.this是一个实例变量,保存的是当前对象的内存地址,指向的是当前对象自身
 * 3.严格意义上来说,this代表的就是"当前对象"
 * 4.this存储在当前对象内部,在堆内存中
 * 5.this只能在实例方法中使用
 */
public class Keyword1_this {
    public static void main(String[] args) {
        System.out.println(Man.SEX);
    }
}

class Man {
    public static final boolean SEX = true;
}