package top.top7.array;

import java.util.Arrays;

/******
 *       Created by LEARNING on 2021/2/23 20:07.
 *
 **********************************************************************
 *                .-~~~~~~~~~-._       _.-~~~~~~~~~-.
 *            __.'              ~.   .~              `.__
 *          .'//                  \./                  \\`.
 *        .'//                     |                     \\`.
 *      .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
 *    .'//.-"                 `-.  |  .-'                 "-.\\`.
 *  .'//______.============-..   \ | /   ..-============.______\\`.
 *.'______________________________\|/______________________________`.
 *
 *
 *                     Don't forget to be awesome!                      
 **********************************************************************
 */

/**
 * java中关于数组的定义与使用
 */
public class PArray1 {
    public static void main(String[] args) {
        int[] a = {1, 5, 6, 8, 2};
        int[] b = {1, 5, 6, 8, 2};

        //数组的equals方法未重写,默认比较地址
        System.out.println(a.equals(b));//false
        //使用Arrays类的equals方法比较两个数组是否相等
        System.out.println(Arrays.equals(a, b));//true
    }
}
