package top.top7.thread;

/******
 *       Created by LEARNING on 2020/11/4 14:16.
 *
 **********************************************************************
 *                .-~~~~~~~~~-._       _.-~~~~~~~~~-.
 *            __.'              ~.   .~              `.__
 *          .'//                  \./                  \\`.
 *        .'//                     |                     \\`.
 *      .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
 *    .'//.-"                 `-.  |  .-'                 "-.\\`.
 *  .'//______.============-..   \ | /   ..-============.______\\`.
 *.'______________________________\|/______________________________`.
 *
 *
 *                     Don't forget to be awesome!                      
 **********************************************************************
 */

/**
 * 1. 怎么获取当前线程对象?
 *  public static native Thread currentThread();//获取当前正在执行的线程对象 Thread.currentThread();Thread
 * 2. 获取线程对象的名字  线程对象.getName()
 * 3. 修改线程对象的名字  线程对象.setName(String)
 * 4. 线程对象默认名称: Thread-0 Thread-1 Thread-2 Thread-3 ... 主线程名称:main
 */
public class PThread3currentThread {
}
